{
    "blogs": [
      {
        "id": 1,
        "image": "/images/download.jpeg",
        "title": "Building My Personal Website: A Journey of Learning and Growth",
        "tags": ["React", "JavaScript"],
        "fulltext": "A personal website has always seemed like the ultimate way to showcase one’s skills—almost a rite of passage for professionals in my generation. Seeing so many successful individuals maintain one, I thought to myself, \"Why can’t I do the same?\".The first step was securing a domain, which I purchased from GoDaddy in early 2024. While many opt for website-building tools to simplify the process, I was drawn to the challenge of coding it from scratch. I knew it would be a long and demanding journey, but my enthusiasm kept me motivated.\n\nAt the time, I had just learned about web development in my third semester of college. Being someone who enjoys applying newly acquired skills, I was eager to experiment—just like a child excited to ride a bicycle after mastering the basics. Naturally, I envisioned a sleek, tech-inspired portfolio with dynamic animations and a dark theme. At least, that was the plan in the beginning.\n\nInitially, everything seemed easy. Setting up the page templates was straightforward, and I quickly outlined the site’s structure. However, the real challenge began when I had to decide on colors and design elements. As someone who isn’t particularly skilled in color selection, finding a palette that was both stylish and subtle proved difficult. Eventually, I settled on a saffron hue (#FF9933)—a choice inspired by a moment of patriotism and an appreciation for its beauty.\n\nWith the color scheme finalized, I turned my attention to animations and effects. By then, I was already feeling accomplished, unaware that the hardest creative work was yet to come. Striking the right balance between visually appealing animations and subtlety was tricky, both in terms of design and implementation. Once that was complete, I faced the most monotonous phase: filling in the actual content. Despite the repetitive nature of this task, I pressed on.\n\nA few days later, while researching how Google ranks websites, I discovered the importance of a *mobile-first* approach. Google prioritizes websites optimized for mobile devices—a realization that, in hindsight, made perfect sense. After all, I find myself searching for information on my phone far more often than on my laptop. However, this also meant I had a significant amount of work ahead. I had to rethink how elements interacted, how tiles stacked on smaller screens, and how to refine the overall mobile experience.\n\nAnother *fortunate* Google search led me to SEO (Search Engine Optimization). I learned that optimizing my website for search engines involved using elements like `Helmet` and `meta` tags to help Google better understand my site’s content. With some assistance from ChatGPT, I implemented the necessary SEO improvements, ensuring my website was discoverable.\n\nOnce everything was in place, I did what many developers are guilty of—I procrastinated. For months, I let the project sit unfinished until a friend started building his own website, reminding me that mine wasn’t even live yet. That very hour, I deployed it on Vercel, connected the necessary DNS routes between GoDaddy and Vercel, and finally, my website was live.\n\nWhile there are still features and improvements I want to make, I take great pride in this first-hand creation. Beyond being a portfolio, I see it as a space to write blogs, share updates about my professional journey, and experiment with new ideas. This project reinforced the immense satisfaction of building something from the ground up, and I encourage everyone to create their own personal website—even if it isn’t a necessity in your field. You might discover a newfound passion, develop valuable skills, and experience the rewarding process of bringing your own ideas to life.",
        "description": "The journey of Hoskere-Verse, from a vision to a reality."
      }
    ]
}